//
//  main.swift
//  Lesson03
//
//  Created by Дмитрий Шикунов on 27.07.2020.
//  Copyright © 2020 Дмитрий Шикунов. All rights reserved.
//

import Foundation

print("Hello, World!")

/* 1. Описать несколько структур – любой легковой автомобиль SportCar и любой грузовик TrunkCar.
Структуры должны содержать марку авто, год выпуска, объем багажника/кузова, запущен ли двигатель, открыты ли окна, заполненный объем багажника.
2. Описать перечисление с возможными действиями с автомобилем: запустить/заглушить двигатель, открыть/закрыть окна, погрузить/выгрузить из кузова/багажника груз определенного объема.
3. Добавить в структуры метод с одним аргументом типа перечисления, который будет менять свойства структуры в зависимости от действия.
4. Инициализировать несколько экземпляров структур. Применить к ним различные действия.
5. Вывести значения свойств экземпляров в консоль
*/
